In [1]:
--1.
select last_name, hire_date from employees where department_id in (select departments.department_id from departments where department_id=8)

last_name,hire_date
Russell,1996-10-01
Partners,1997-01-05
Taylor,1998-03-24
Livingston,1998-04-23
Grant,1999-05-24
Johnson,2000-01-04

In [1]:
--2.
select employee_id, first_name, salary from employees where salary in (select salary from employees where salary >= 8200) order by salary asc

employee_id,first_name,salary
110,John,8200.00
121,Adam,8200.00
206,William,8300.00
177,Jack,8400.00
176,Jonathon,8600.00
103,Alexander,9000.00
109,Daniel,9000.00
204,Hermann,10000.00
114,Den,11000.00
108,Nancy,12000.00
205,Shelley,12000.00
201,Michael,13000.00
146,Karen,13500.00
145,John,14000.00
101,Neena,17000.00
102,Lex,17000.00
100,Steven,24000.00

In [2]:
--3.
SELECT employee_id AS 'Employee Number' ,last_name from employees where employee_id in (select employee_id from employees where employee_id in(103,105,112,118,122,145))

Employee Number,last_name
103,Hunold
105,Austin
112,Urman
118,Himuro
122,Kaufling
145,Russell

In [3]:
--4.
select last_name, job_id, department_id from employees where employee_id in (select employee_id from employees where employee_id=203)

last_name,job_id,department_id
Mavris,8,4

In [4]:
--5.
select last_name, salary from employees where employee_id in (select employee_id from employees where manager_id=100)

last_name,salary
Kochhar,17000.00
De Haan,17000.00
Raphaely,11000.00
Weiss,8000.00
Fripp,8200.00
Kaufling,7900.00
Vollman,6500.00
Russell,14000.00
Partners,13500.00
Taylor,8600.00
Livingston,8400.00
Grant,7000.00
Johnson,6200.00
Hartstein,13000.00

In [5]:
--6.
select department_id as 'Department Name', last_name, job_id from employees where employee_id in(select employee_id from employees where job_id =9  )

Department Name,last_name,job_id
6,Hunold,9
6,Ernst,9
6,Austin,9
6,Pataballa,9
6,Lorentz,9

In [6]:
--7.
select employee_id,last_name,salary from employees where employee_id in(select employee_id from employees where employee_id in(103,145))

employee_id,last_name,salary
103,Hunold,9000.00
145,Russell,14000.00

In [ ]:
--8.
select first_name from employees where employee_id in( select employee_id from employees where phone_number is null)

first_name
Charles
Jack
John
Jonathon
Karen
Kimberely

In [8]:
--9.
select last_name, salary from employees where employee_id in (select employee_id from employees where salary >=17000)

last_name,salary
King,24000.00
Kochhar,17000.00
De Haan,17000.00

In [9]:
--10.
select  first_name, salary, department_id from employees where employee_id in(select employee_id from employees where salary >=14000 and manager_id=100 )

first_name,salary,department_id
Neena,17000.00,9
Lex,17000.00,9
John,14000.00,8